{
  "privacy": {
    "title": "Privacy Policy",
    "lastUpdated": "Last updated: October 31, 2025",
    "intro": {
      "title": "Introduction",
      "p1": "MyAgentWebsite.com (\"we\", \"our\", or \"us\") is committed to protecting your privacy. This Privacy Policy explains how we collect, use, disclose, and safeguard your information when you visit our website and use our services.",
      "p2": "Please read this privacy policy carefully. If you do not agree with the terms of this privacy policy, please do not access the site or use our services."
    },
    "collection": {
      "title": "Information We Collect",
      "personal": {
        "title": "Personal Information",
        "intro": "We collect information that you voluntarily provide to us when you:",
        "items": [
          "Register for an account and access our backoffice",
          "Create and manage property listings",
          "Upload photos to your photo library",
          "Subscribe to newsletter services",
          "Fill out contact forms or request demos",
          "Use our API for custom integrations",
          "Communicate with us via email or support channels"
        ],
        "types": "This information may include:",
        "typesList": [
          "Name, email address, and phone number",
          "Real estate agency name and business information",
          "Property listing data (addresses, descriptions, prices, photos)",
          "Client testimonials and reviews you choose to display",
          "Newsletter subscriber information (names, email addresses)",
          "Payment information (processed securely through Stripe)",
          "API keys and authentication credentials",
          "Profile information, preferences, and account settings"
        ]
      },
      "automatic": {
        "title": "Automatically Collected Information",
        "intro": "When you visit our website, we automatically collect certain information about your device, including:",
        "items": [
          "IP address",
          "Browser type and version",
          "Operating system",
          "Pages visited and time spent on pages",
          "Referring website addresses",
          "Device information"
        ]
      }
    },
    "usage": {
      "title": "How We Use Your Information",
      "intro": "We use the information we collect for various purposes, including:",
      "items": [
        "Providing, operating, and maintaining our real estate website platform and API",
        "Managing your backoffice access and property listings",
        "Storing and organizing your photo library",
        "Managing newsletter subscribers and enabling CSV exports",
        "Generating preview mode links for quality control",
        "Processing your transactions and managing your subscription",
        "Responding to inquiries and providing priority or email support",
        "Hosting and maintaining your website (Professional plan)",
        "Sending administrative emails, security updates, and service notifications",
        "Improving our platform, backoffice, and API services",
        "Analyzing usage patterns to enhance features",
        "Detecting and preventing fraud, abuse, and unauthorized access",
        "Complying with legal obligations and data protection regulations"
      ]
    },
    "cookies": {
      "title": "Cookies and Tracking Technologies",
      "intro": "We use cookies and similar tracking technologies to track activity on our website and store certain information. Cookies are files with a small amount of data that are sent to your browser from a website and stored on your device.",
      "types": {
        "title": "Types of Cookies We Use",
        "items": [
          {
            "name": "Essential Cookies",
            "desc": "Required for the website to function properly"
          },
          {
            "name": "Analytics Cookies",
            "desc": "Help us understand how visitors use our website"
          },
          {
            "name": "Preference Cookies",
            "desc": "Remember your settings and preferences"
          }
        ]
      },
      "control": "You can instruct your browser to refuse all cookies or to indicate when a cookie is being sent. However, if you do not accept cookies, you may not be able to use some portions of our service."
    },
    "thirdParty": {
      "title": "Third-Party Services",
      "intro": "We use third-party service providers to help us operate our platform and deliver our services. These third parties include:",
      "services": [
        {
          "name": "Stripe",
          "purpose": "Secure payment processing for subscriptions and one-time services"
        },
        {
          "name": "Railway / Vercel",
          "purpose": "Cloud hosting for backend API and frontend applications"
        },
        {
          "name": "Cloudflare",
          "purpose": "Content delivery network (CDN), DNS management, and security"
        },
        {
          "name": "Image Hosting Services",
          "purpose": "Storing and optimizing property photos in your photo library"
        },
        {
          "name": "Email Service Providers",
          "purpose": "Sending transactional emails, password resets, and notifications"
        },
        {
          "name": "Analytics Services",
          "purpose": "Understanding website usage to improve our platform"
        }
      ],
      "note": "These third parties have access to your information only to perform specific tasks on our behalf and are contractually obligated not to disclose or use it for any other purpose. We carefully vet all third-party providers to ensure they meet our security and privacy standards."
    },
    "security": {
      "title": "Data Security",
      "intro": "We implement appropriate technical and organizational security measures to protect your personal information against unauthorized access, alteration, disclosure, or destruction. These measures include:",
      "measures": [
        "SSL/TLS encryption (HTTPS) for all data transmission",
        "Secure authentication and password hashing for backoffice access",
        "API key authentication for developer integrations",
        "Secure token generation for preview mode links with time-based expiration",
        "Regular security updates and patches",
        "Database encryption and access controls",
        "Secure file storage for photos and media in your photo library",
        "Cloudflare WAF (Web Application Firewall) protection",
        "Regular backups and disaster recovery procedures",
        "Employee and contractor training on data protection and privacy"
      ],
      "disclaimer": "However, no method of transmission over the Internet or electronic storage is 100% secure. While we strive to use commercially acceptable means to protect your information, we cannot guarantee its absolute security. We recommend using strong passwords and not sharing your backoffice credentials."
    },
    "retention": {
      "title": "Data Retention",
      "content": "We retain your personal information for as long as your account is active or as needed to provide you services. Property listings, photos in your photo library, and content you create remain available while your subscription is active. Newsletter subscriber data is retained until you request deletion or export it. After account cancellation, we retain certain information for legal and tax purposes (typically 7 years for financial records). Backups may retain data for up to 90 days. You can request deletion of your data at any time by contacting us, subject to our legal obligations."
    },
    "rights": {
      "title": "Your Rights Under GDPR",
      "intro": "If you are a resident of the European Economic Area (EEA), you have certain data protection rights:",
      "items": [
        {
          "name": "Right to Access",
          "desc": "Request copies of your personal data"
        },
        {
          "name": "Right to Rectification",
          "desc": "Request correction of inaccurate information"
        },
        {
          "name": "Right to Erasure",
          "desc": "Request deletion of your personal data"
        },
        {
          "name": "Right to Restrict Processing",
          "desc": "Request limitation of processing"
        },
        {
          "name": "Right to Data Portability",
          "desc": "Request transfer of your data"
        },
        {
          "name": "Right to Object",
          "desc": "Object to processing of your data"
        },
        {
          "name": "Right to Withdraw Consent",
          "desc": "Withdraw consent at any time"
        }
      ],
      "exercise": "To exercise any of these rights, please contact us at the email address provided below."
    },
    "children": {
      "title": "Children's Privacy",
      "content": "Our services are not intended for individuals under the age of 18. We do not knowingly collect personal information from children. If you are a parent or guardian and believe your child has provided us with personal information, please contact us immediately."
    },
    "international": {
      "title": "International Data Transfers",
      "content": "Your information may be transferred to and maintained on servers located outside of your country where data protection laws may differ. We ensure appropriate safeguards are in place to protect your information in accordance with this Privacy Policy and applicable laws."
    },
    "changes": {
      "title": "Changes to This Privacy Policy",
      "content": "We may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page and updating the \"Last updated\" date. You are advised to review this Privacy Policy periodically for any changes."
    },
    "contact": {
      "title": "Contact Us",
      "intro": "If you have any questions about this Privacy Policy, want to exercise your data rights, or have concerns about our data practices, please contact us:",
      "email": "Email",
      "website": "Website",
      "address": "Data Protection Officer",
      "addressValue": "For data protection inquiries: privacy@myagentwebsite.com"
    }
  }
}
