{
  "terms": {
    "title": "Terms of Service",
    "lastUpdated": "Last updated: October 31, 2025",
    "agreement": {
      "title": "Agreement to Terms",
      "p1": "These Terms of Service (\"Terms\") govern your access to and use of MyAgentWebsite.com (the \"Service\"), operated by MyAgentWebsite.com (\"we\", \"us\", or \"our\").",
      "p2": "By accessing or using the Service, you agree to be bound by these Terms. If you disagree with any part of these Terms, you may not access the Service."
    },
    "description": {
      "title": "Description of Service",
      "intro": "MyAgentWebsite.com provides a comprehensive website building platform and API specifically designed for real estate agents and agencies. The Service allows users to:",
      "features": [
        "Create and manage professional real estate websites",
        "Access a backoffice admin panel for content management",
        "Publish individual property listings and entire property developments",
        "Manage a centralized photo library for property images",
        "Display client testimonials and reviews",
        "Collect and manage newsletter subscribers with CSV export",
        "Use preview mode to review changes before publishing",
        "Capture leads through contact forms and newsletter signups",
        "Write and publish blog posts",
        "Access a full REST API for custom integrations (Developer plan)",
        "Connect custom domains (Professional and Enterprise plans)",
        "Receive hosting, maintenance, and support (Professional and Enterprise plans)"
      ]
    },
    "account": {
      "title": "Account Registration",
      "requirements": {
        "title": "Account Requirements",
        "intro": "To use the Service, you must:",
        "items": [
          "Be at least 18 years old",
          "Provide accurate and complete registration information",
          "Maintain the security of your account credentials",
          "Accept responsibility for all activities under your account"
        ]
      },
      "security": {
        "title": "Account Security",
        "content": "You are responsible for maintaining the confidentiality of your account password, backoffice credentials, and API keys (if applicable). You must not share your credentials with unauthorized parties. You are fully responsible for all activities that occur under your account. You must immediately notify us of any unauthorized use of your account or security breach."
      }
    },
    "payment": {
      "title": "Subscription Plans and Payment",
      "pricing": {
        "title": "Pricing",
        "intro": "We offer multiple subscription plans and one-time services with different features and pricing:",
        "plans": [
          "Developer Plan: €199/month - Full API and backoffice access (you host your own frontend)",
          "Professional Plan: €499/month - Complete managed solution with hosting, maintenance, and support",
          "Enterprise Plan: Custom pricing - Multiple websites, white-label options, and dedicated support",
          "One-Time Design + Build Services: Starting at €2,000 for design or €3,500 for build (separate from monthly subscriptions)"
        ],
        "changes": "Pricing is subject to change with 30 days' notice to current subscribers. One-time service pricing may change without notice for new customers."
      },
      "terms": {
        "title": "Payment Terms",
        "content": "Monthly subscriptions are billed in advance on a recurring basis. One-time design and build services require 50% payment upfront and 50% upon completion. Payment must be made by credit card, bank transfer, or other accepted payment methods. By providing payment information, you authorize us to charge the applicable fees. All payments are processed securely through Stripe."
      },
      "trial": {
        "title": "Free Trial",
        "content": "We may offer a 14-day free trial. At the end of the trial period, your subscription will automatically convert to a paid subscription unless you cancel before the trial ends."
      },
      "refunds": {
        "title": "Refunds",
        "content": "We offer a 14-day money-back guarantee for new monthly subscriptions. Refund requests must be made within 14 days of the initial purchase. Refunds are not available for subscription renewals or one-time design/build services after work has commenced. If you paid for design/build services, the completed work remains your property even if you cancel your monthly subscription."
      }
    },
    "cancellation": {
      "title": "Cancellation and Termination",
      "byUser": {
        "title": "Cancellation by User",
        "content": "You may cancel your monthly subscription at any time by providing 30 days' notice through your account settings or by contacting us. Cancellation will take effect at the end of your current billing period after the 30-day notice. You will continue to have access to the Service until the end of the paid period. We recommend exporting your newsletter subscribers (CSV), property data, and downloading photos from your photo library before cancellation."
      },
      "byUs": {
        "title": "Termination by Us",
        "intro": "We reserve the right to suspend or terminate your account if you:",
        "reasons": [
          "Violate these Terms of Service",
          "Engage in fraudulent or illegal activities",
          "Fail to pay subscription fees",
          "Abuse or misuse the Service"
        ]
      },
      "data": {
        "title": "Data After Termination",
        "content": "Upon termination, your property listings, photo library, blog posts, testimonials, and newsletter subscribers will be retained for 30 days to allow for potential account reactivation. After 30 days, all data will be permanently deleted from our systems (backups may retain data for up to 90 days). You are responsible for exporting all data you wish to retain, including newsletter subscribers (CSV export), property listings, and photos, before the 30-day retention period expires. If you purchased design/build services, you retain ownership of that work regardless of subscription status."
      }
    },
    "content": {
      "title": "User Content and Ownership",
      "yours": {
        "title": "Your Content",
        "content": "You retain all ownership rights to the content you upload to the Service, including property listings, property developments, photos in your photo library, blog posts, testimonials, newsletter subscriber data, and any other materials (\"User Content\"). If you purchased design/build services, you own the resulting website design and code."
      },
      "license": {
        "title": "License to Us",
        "content": "By uploading User Content, you grant us a limited, non-exclusive, worldwide license to use, store, display, and transmit your content solely for the purpose of providing the Service. This includes displaying your property listings on your website, storing photos in your photo library, managing newsletter subscribers, and generating preview mode links. This license terminates when you delete the content or terminate your account."
      },
      "responsibility": {
        "title": "Content Responsibility",
        "content": "You are solely responsible for your User Content and must ensure you have all necessary rights, licenses, and permissions, including rights to property photos and testimonials. You represent that you have proper authorization to list properties and use associated images. You agree not to upload content that is illegal, infringing, defamatory, obscene, misleading, or otherwise objectionable."
      }
    },
    "acceptable": {
      "title": "Acceptable Use Policy",
      "intro": "You agree not to use the Service, backoffice, or API to:",
      "prohibitions": [
        "Violate any laws or regulations",
        "Infringe on intellectual property rights",
        "Transmit viruses, malware, or harmful code",
        "Engage in spam or unsolicited marketing via newsletter features",
        "Harass, abuse, or harm others",
        "Impersonate another person, entity, or real estate agency",
        "Upload false or misleading property listings",
        "Attempt to gain unauthorized access to systems, accounts, or API endpoints",
        "Interfere with the proper functioning of the Service or exceed API rate limits",
        "Use automated systems to scrape or harvest data beyond normal API usage",
        "Share your backoffice credentials or API keys with unauthorized parties",
        "Resell or redistribute the Service without authorization (Enterprise white-label excepted)"
      ]
    },
    "intellectual": {
      "title": "Intellectual Property",
      "p1": "The Service, including its original content, features, and functionality, is owned by MyAgentWebsite.com and protected by international copyright, trademark, and other intellectual property laws.",
      "p2": "Our trademarks, logos, and service marks may not be used without our prior written permission."
    },
    "liability": {
      "title": "Limitation of Liability",
      "content": "TO THE MAXIMUM EXTENT PERMITTED BY LAW, MYAGENTWEBSITE.COM SHALL NOT BE LIABLE FOR ANY INDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL, OR PUNITIVE DAMAGES, OR ANY LOSS OF PROFITS OR REVENUES, WHETHER INCURRED DIRECTLY OR INDIRECTLY, OR ANY LOSS OF DATA, USE, GOODWILL, OR OTHER INTANGIBLE LOSSES. OUR TOTAL LIABILITY SHALL NOT EXCEED THE AMOUNT YOU PAID US IN THE 12 MONTHS PRECEDING THE CLAIM."
    },
    "warranties": {
      "title": "Disclaimer of Warranties",
      "content": "THE SERVICE IS PROVIDED \"AS IS\" AND \"AS AVAILABLE\" WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT. WE DO NOT GUARANTEE THAT THE SERVICE WILL BE UNINTERRUPTED, SECURE, OR ERROR-FREE."
    },
    "indemnification": {
      "title": "Indemnification",
      "content": "You agree to indemnify and hold harmless MyAgentWebsite.com and its officers, directors, employees, and agents from any claims, damages, losses, liabilities, and expenses (including legal fees) arising from your use of the Service or violation of these Terms."
    },
    "disputes": {
      "title": "Dispute Resolution",
      "governing": {
        "title": "Governing Law",
        "content": "These Terms shall be governed by and construed in accordance with the laws of Portugal, without regard to its conflict of law provisions."
      },
      "resolution": {
        "title": "Dispute Resolution Process",
        "content": "In the event of any dispute, you agree to first contact us to seek resolution informally. If the dispute cannot be resolved informally, it shall be resolved through binding arbitration or in the courts of Portugal."
      }
    },
    "changes": {
      "title": "Changes to Terms",
      "content": "We reserve the right to modify these Terms at any time. We will notify you of material changes by email or through the Service. Your continued use of the Service after such modifications constitutes acceptance of the updated Terms."
    },
    "severability": {
      "title": "Severability",
      "content": "If any provision of these Terms is found to be unenforceable or invalid, that provision will be limited or eliminated to the minimum extent necessary, and the remaining provisions will remain in full force and effect."
    },
    "entire": {
      "title": "Entire Agreement",
      "content": "These Terms constitute the entire agreement between you and MyAgentWebsite.com regarding the Service and supersede all prior agreements and understandings."
    },
    "contact": {
      "title": "Contact Us",
      "intro": "If you have any questions about these Terms of Service, billing inquiries, or need support, please contact us:",
      "email": "Email",
      "website": "Website",
      "address": "Support",
      "addressValue": "For general inquiries: support@myagentwebsite.com"
    }
  }
}
