{
  "privacy": {
    "title": "Política de Privacidade",
    "lastUpdated": "Última atualização: 31 de outubro de 2025",
    "intro": {
      "title": "Introdução",
      "p1": "MyAgentWebsite.com (\"nós\", \"nosso\" ou \"nos\") está comprometido em proteger a sua privacidade. Esta Política de Privacidade explica como coletamos, usamos, divulgamos e protegemos as suas informações quando visita o nosso website e utiliza os nossos serviços.",
      "p2": "Por favor, leia esta política de privacidade cuidadosamente. Se não concordar com os termos desta política de privacidade, por favor não aceda ao site ou utilize os nossos serviços."
    },
    "collection": {
      "title": "Informação que Coletamos",
      "personal": {
        "title": "Informação Pessoal",
        "intro": "Coletamos informação que nos fornece voluntariamente quando:",
        "items": [
          "Regista uma conta e acede ao nosso backoffice",
          "Cria e gere anúncios de propriedades",
          "Carrega fotos para a sua biblioteca de fotos",
          "Subscreve serviços de newsletter",
          "Preenche formulários de contacto ou solicita demonstrações",
          "Utiliza a nossa API para integrações personalizadas",
          "Comunica connosco via email ou canais de suporte"
        ],
        "types": "Esta informação pode incluir:",
        "typesList": [
          "Nome, endereço de email e número de telefone",
          "Nome da agência imobiliária e informação empresarial",
          "Dados de anúncios de propriedades (moradas, descrições, preços, fotos)",
          "Testemunhos e avaliações de clientes que escolhe exibir",
          "Informação de subscritores de newsletter (nomes, endereços de email)",
          "Informação de pagamento (processada com segurança através do Stripe)",
          "Chaves de API e credenciais de autenticação",
          "Informação de perfil, preferências e definições de conta"
        ]
      },
      "automatic": {
        "title": "Informação Coletada Automaticamente",
        "intro": "Quando visita o nosso website, coletamos automaticamente certas informações sobre o seu dispositivo, incluindo:",
        "items": [
          "Endereço IP",
          "Tipo e versão do navegador",
          "Sistema operativo",
          "Páginas visitadas e tempo gasto nas páginas",
          "Endereços de websites de referência",
          "Informação do dispositivo"
        ]
      }
    },
    "usage": {
      "title": "Como Usamos a Sua Informação",
      "intro": "Usamos a informação que coletamos para vários propósitos, incluindo:",
      "items": [
        "Fornecer, operar e manter a nossa plataforma de websites imobiliários e API",
        "Gerir o seu acesso ao backoffice e anúncios de propriedades",
        "Armazenar e organizar a sua biblioteca de fotos",
        "Gerir subscritores de newsletter e permitir exportações CSV",
        "Gerar links de modo de pré-visualização para controlo de qualidade",
        "Processar as suas transações e gerir a sua subscrição",
        "Responder a questões e fornecer suporte prioritário ou por email",
        "Hospedar e manter o seu website (plano Professional)",
        "Enviar emails administrativos, atualizações de segurança e notificações de serviço",
        "Melhorar a nossa plataforma, backoffice e serviços de API",
        "Analisar padrões de uso para melhorar funcionalidades",
        "Detetar e prevenir fraude, abuso e acesso não autorizado",
        "Cumprir obrigações legais e regulamentos de proteção de dados"
      ]
    },
    "cookies": {
      "title": "Cookies e Tecnologias de Rastreamento",
      "intro": "Usamos cookies e tecnologias de rastreamento semelhantes para rastrear atividade no nosso website e armazenar certas informações. Cookies são ficheiros com uma pequena quantidade de dados que são enviados para o seu navegador a partir de um website e armazenados no seu dispositivo.",
      "types": {
        "title": "Tipos de Cookies que Usamos",
        "items": [
          {
            "name": "Cookies Essenciais",
            "desc": "Necessários para o website funcionar corretamente"
          },
          {
            "name": "Cookies de Análise",
            "desc": "Ajudam-nos a entender como os visitantes usam o nosso website"
          },
          {
            "name": "Cookies de Preferência",
            "desc": "Lembram as suas configurações e preferências"
          }
        ]
      },
      "control": "Pode instruir o seu navegador para recusar todos os cookies ou para indicar quando um cookie está a ser enviado. No entanto, se não aceitar cookies, pode não conseguir usar algumas partes do nosso serviço."
    },
    "thirdParty": {
      "title": "Serviços de Terceiros",
      "intro": "Usamos fornecedores de serviços terceiros para nos ajudar a operar a nossa plataforma e entregar os nossos serviços. Estes terceiros incluem:",
      "services": [
        {
          "name": "Stripe",
          "purpose": "Processamento seguro de pagamentos para subscrições e serviços únicos"
        },
        {
          "name": "Railway / Vercel",
          "purpose": "Alojamento cloud para API backend e aplicações frontend"
        },
        {
          "name": "Cloudflare",
          "purpose": "Rede de distribuição de conteúdo (CDN), gestão de DNS e segurança"
        },
        {
          "name": "Serviços de Alojamento de Imagens",
          "purpose": "Armazenar e otimizar fotos de propriedades na sua biblioteca de fotos"
        },
        {
          "name": "Fornecedores de Serviço de Email",
          "purpose": "Enviar emails transacionais, redefinições de senha e notificações"
        },
        {
          "name": "Serviços de Análise",
          "purpose": "Compreender o uso do website para melhorar a nossa plataforma"
        }
      ],
      "note": "Estes terceiros têm acesso à sua informação apenas para realizar tarefas específicas em nosso nome e são contratualmente obrigados a não divulgar ou usar para qualquer outro propósito. Verificamos cuidadosamente todos os fornecedores terceiros para garantir que cumprem os nossos padrões de segurança e privacidade."
    },
    "security": {
      "title": "Segurança de Dados",
      "intro": "Implementamos medidas de segurança técnicas e organizacionais apropriadas para proteger a sua informação pessoal contra acesso não autorizado, alteração, divulgação ou destruição. Estas medidas incluem:",
      "measures": [
        "Encriptação SSL/TLS (HTTPS) para toda a transmissão de dados",
        "Autenticação segura e hashing de senhas para acesso ao backoffice",
        "Autenticação por chave de API para integrações de programadores",
        "Geração segura de tokens para links de modo de pré-visualização com expiração temporal",
        "Atualizações e patches de segurança regulares",
        "Encriptação de base de dados e controlos de acesso",
        "Armazenamento seguro de ficheiros para fotos e media na sua biblioteca de fotos",
        "Proteção WAF (Web Application Firewall) da Cloudflare",
        "Backups regulares e procedimentos de recuperação de desastres",
        "Formação de funcionários e contratados em proteção de dados e privacidade"
      ],
      "disclaimer": "No entanto, nenhum método de transmissão pela Internet ou armazenamento eletrónico é 100% seguro. Embora nos esforcemos para usar meios comercialmente aceitáveis para proteger a sua informação, não podemos garantir a sua segurança absoluta. Recomendamos usar senhas fortes e não partilhar as suas credenciais do backoffice."
    },
    "retention": {
      "title": "Retenção de Dados",
      "content": "Retemos a sua informação pessoal enquanto a sua conta estiver ativa ou conforme necessário para fornecer os serviços. Anúncios de propriedades, fotos na sua biblioteca de fotos e conteúdo que cria permanecem disponíveis enquanto a sua subscrição estiver ativa. Dados de subscritores de newsletter são retidos até solicitar eliminação ou exportá-los. Após o cancelamento da conta, retemos certas informações para fins legais e fiscais (tipicamente 7 anos para registos financeiros). Os backups podem reter dados até 90 dias. Pode solicitar a eliminação dos seus dados a qualquer momento contactando-nos, sujeito às nossas obrigações legais."
    },
    "rights": {
      "title": "Os Seus Direitos ao Abrigo do RGPD",
      "intro": "Se é residente no Espaço Económico Europeu (EEE), tem certos direitos de proteção de dados:",
      "items": [
        {
          "name": "Direito de Acesso",
          "desc": "Solicitar cópias dos seus dados pessoais"
        },
        {
          "name": "Direito de Retificação",
          "desc": "Solicitar correção de informação incorreta"
        },
        {
          "name": "Direito ao Apagamento",
          "desc": "Solicitar eliminação dos seus dados pessoais"
        },
        {
          "name": "Direito de Limitação do Tratamento",
          "desc": "Solicitar limitação do processamento"
        },
        {
          "name": "Direito à Portabilidade dos Dados",
          "desc": "Solicitar transferência dos seus dados"
        },
        {
          "name": "Direito de Oposição",
          "desc": "Opor-se ao processamento dos seus dados"
        },
        {
          "name": "Direito de Retirar o Consentimento",
          "desc": "Retirar consentimento a qualquer momento"
        }
      ],
      "exercise": "Para exercer qualquer um destes direitos, por favor contacte-nos no endereço de email fornecido abaixo."
    },
    "children": {
      "title": "Privacidade de Crianças",
      "content": "Os nossos serviços não se destinam a indivíduos com menos de 18 anos. Não coletamos intencionalmente informação pessoal de crianças. Se é pai ou tutor e acredita que o seu filho nos forneceu informação pessoal, por favor contacte-nos imediatamente."
    },
    "international": {
      "title": "Transferências Internacionais de Dados",
      "content": "A sua informação pode ser transferida e mantida em servidores localizados fora do seu país onde as leis de proteção de dados podem diferir. Garantimos que salvaguardas apropriadas estão implementadas para proteger a sua informação de acordo com esta Política de Privacidade e leis aplicáveis."
    },
    "changes": {
      "title": "Alterações a Esta Política de Privacidade",
      "content": "Podemos atualizar a nossa Política de Privacidade periodicamente. Iremos notificá-lo de quaisquer alterações publicando a nova Política de Privacidade nesta página e atualizando a data de \"Última atualização\". Aconselhamos a rever esta Política de Privacidade periodicamente para quaisquer alterações."
    },
    "contact": {
      "title": "Contacte-nos",
      "intro": "Se tiver alguma questão sobre esta Política de Privacidade, quiser exercer os seus direitos de dados ou tiver preocupações sobre as nossas práticas de dados, por favor contacte-nos:",
      "email": "Email",
      "website": "Website",
      "address": "Responsável pela Proteção de Dados",
      "addressValue": "Para questões de proteção de dados: privacy@myagentwebsite.com"
    }
  }
}
